#language: ru
Функционал: Рассчитать доходность по вкладу

  @web
  Сценарий: "Добавление и удаление товаров в корзине"

    * переход на страницу с корзиной
    * нажимаем кнопку Войдите
    * нажимаем кнопку Войти по почте
    * заполняем логин "onlywarinfarfuture@gmail.com"
    * заполняем пароль "tutu147AA"
    * нажимаем кнопку Войти после введенных логин пароль
    * выбираем в главном поиске значения "iPhone 7 Plus/8 Plus Black"
    * нажимаем кнопку поиска
    * выбираем "5" товаров и нажимаем купить
    * переход на страницу с корзиной
    * проверяем что выбранные товары в корзине
    * удаляем все товары из корзины
    * разлогиниваемся
    * нажимаем кнопку Войдите
    * нажимаем кнопку Войти по почте
    * заполняем логин "onlywarinfarfuture@gmail.com"
    * заполняем пароль "tutu147AA"
    * нажимаем кнопку Войти после введенных логин пароль
    * проверяем что корзина пустая